# IFCParameter Template Set Property Set Exporting Flag Method

Source: https://www.revitapidocs.com/2026/270b08c7-4f47-4529-d331-c39b5f2813d5.htm

---

| IFCParameter Template Set Property Set Exporting Flag Method |
| --- |

Define whether the provided property set must be included in export.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetPropertySetExportingFlag(
	PropertySetupType propertySetupType,
	string propertySetName,
	bool exportFlag
)
```

```
Public Sub SetPropertySetExportingFlag (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	exportFlag As Boolean
)
```

```
public:
void SetPropertySetExportingFlag(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	bool exportFlag
)
```

```
member SetPropertySetExportingFlag :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        exportFlag : bool -> unit
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

exportFlag Boolean
:   The export flag.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | A property set with the given name is not present in the template. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace